# ************************************************************
# Sequel Pro SQL dump
# Версия 4541
#
# http://www.sequelpro.com/
# https://github.com/sequelpro/sequelpro
#
# Адрес: 127.0.0.1 (MySQL 5.7.11)
# Схема: hungry_storm
# Время создания: 2016-05-19 13:28:10 +0000
# ************************************************************


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


# Дамп таблицы spo_schools
# ------------------------------------------------------------

DROP TABLE IF EXISTS `spo_schools`;

CREATE TABLE `spo_schools` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `region_id` int(10) unsigned DEFAULT NULL,
  `city_id` int(10) unsigned DEFAULT NULL,
  `title` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `address` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `phone` varchar(24) COLLATE utf8_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `all_where` (`region_id`,`city_id`),
  KEY `region_foreign_idx` (`region_id`),
  KEY `city_foreign_idx` (`city_id`),
  CONSTRAINT `schools_city_id_foreign` FOREIGN KEY (`city_id`) REFERENCES `spo_cities` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION,
  CONSTRAINT `schools_region_id_foreign` FOREIGN KEY (`region_id`) REFERENCES `spo_regions` (`id`) ON DELETE CASCADE ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

LOCK TABLES `spo_schools` WRITE;
/*!40000 ALTER TABLE `spo_schools` DISABLE KEYS */;

INSERT INTO `spo_schools` (`id`, `region_id`, `city_id`, `title`, `address`, `phone`, `created_at`, `updated_at`)
VALUES
	(1,1,63,'Школа № 17','ул. Спирина, д. 8,  ','+7 (496) 616-87-20 ','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(2,1,63,'Школа № 30','ул. Цементников, д. 17, ','+7 (496) 613-94-24 ','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(3,1,63,'Школа № 20','ул. Шавырина, д. 5,  ','+7 (496) 618-14-88 ','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(4,1,63,'Школа № 14','ул. Шилова, д. 7,  ','+7 (496) 612-10-87 ','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(5,1,63,'Школа № 18','ул. Южная, д. 7,  ','+7 (496) 615-75-55','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(6,1,63,'Школа № 3','ул. Лазарева, д. 12,  ','+7 (496) 618-60-13 ','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(7,1,63,'Школа № 28','ул. Ларцевы Поляны,  ','+7 (496) 613-92-86','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(8,1,63,'Гимназия № 8','ул. Леваневского, д. 8,  ','+7 (496) 612-71-56 ','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(9,1,63,'Школа № 24','ул. Ленина, д. 1,  ','+7 (496) 613-30-96 ','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(10,1,63,'Специальная общеообразовательная школа -интернат № 27 для воспитанников с отклонениями в развитии','ул. Малая Запрудная, д. 36,  ','телефон не указан','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(11,1,63,'Школа № 1','ул. Менделеева, д. 18,  ','+7 (496) 612-15-61 ','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(12,1,63,'Гимназия № 9','ул. Октябрьской Революции, д. 322,  ','+7 (496) 613-43-02','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(13,1,63,'Гимназия № 1 открытая (сменная)','ул. Октябрьской Революции, д. 408/а,  ','+7 (496) 613-34-98','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(14,1,63,'Песковская школа','пос. Пески, ул. Почтовая, д. 34,  ','+7 (496) 617-78-83','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(15,1,63,'Школа № 15','бульв. 800-летия Коломны, д. 9,  ','+7 (496) 618-30-17','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(16,1,63,'Школа № 29','ул. Дачная, д. 1/а, ','+7 (496) 615-23-13 ','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(17,1,63,'Специальная общеообразовательная школа -интернат № 19 для воспитанников с отклонениями в развитии','ул. Дачная, д. 40,  ','+7 (496) 615-26-93 ','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(18,1,63,'Школа № 16','ул. Девичье Поле, д. 9, ','+7 (496) 616-89-31 ','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(19,1,63,'Школа № 21','ул. Дзержинского, д. 11, ','+7 (496) 618-13-56','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(20,1,63,'Школа № 11','ул. Дзержинского, д. 27, ','+7 (496) 613-31-17','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(21,1,63,'Школа № 10','ул. Дзержинского, д. 90, ','+7 (496) 612-25-92','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(22,1,63,'Школа № 5','наб. Дмитрия Донского, д. 30,  ','+7 (496) 619-28-56','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(23,1,63,'Школа № 4','ул. Добролюбова, д. 2/а, ','+7 (496) 612-11-47','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(24,1,63,'Школа № 12','ул. Зеленая, д. 3,  ','+7 (496) 612-21-51','2016-05-19 13:26:33','2016-05-19 13:26:33'),
	(25,1,63,'Гимназия № 2 Квантор','ул. Калинина, д. 14/а, ','+7 (496) 613-31-13 ','2016-05-19 13:26:33','2016-05-19 13:26:33');

/*!40000 ALTER TABLE `spo_schools` ENABLE KEYS */;
UNLOCK TABLES;



/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
